bajihahaha/-/RTthread_Blink_DeepSleep - 副本 (2)/Drivers/fm33a0xxev_gpio.c
		temp = (GPIOx->FCR>>(pinbit*2))&0x00000003;                                    
		if(temp == (uint32_t)GPIO_FCR_IN)
		{                                         
			para->PxFCR = GPIO_FCR_IN;
		}
		else if(temp == (uint32_t)GPIO_FCR_OUT)
		{
			para->PxFCR = GPIO_FCR_OUT;
		}
		else if(temp == (uint32_t)GPIO_FCR_DIG)
		{                                         
			para->PxFCR = GPIO_FCR_DIG;
		}
		else
		{
			para->PxFCR = GPIO_FCR_ANA;
		}
	}  
}

/********************************
读取GPIOx输入数据寄存器函数
功能:读取GPIOx输入数据寄存器
输入：GPIOx_PIN引脚 
输出: 数据寄存器值
********************************/
uint32_t GPIO_ReadInputData(GPIO_Type* GPIOx)
{
	assert_param(IS_GPIO_ALL_PERIPH(GPIOx));
	return (GPIOx->DIN);
}

/********************************
读取GPIOx输入数据寄存器bit函数
功能:GPIOx输入数据寄存器bit
输入：GPIO端口  GPIO_PIN引脚 
输出: bit状态
********************************/
uint8_t GPIO_ReadInputDataBit(GPIO_Type* GPIOx, uint32_t GPIO_Pin)
{
	uint8_t bitstatus = 0x00;

	assert_param(IS_GPIO_ALL_PERIPH(GPIOx));
	assert_param(IS_GET_GPIO_PIN(GPIO_Pin));

	if ((GPIOx->DIN & GPIO_Pin) != (uint32_t)Bit_RESET)
	{
        bitstatus = (uint8_t)Bit_SET;
	}
	else
	{
        bitstatus = (uint8_t)Bit_RESET;
	}
	return bitstatus;
}

/********************************
GPIOx输出置1函数
功能: GPIOx输出置1
输入：GPIO端口  GPIO_PIN引脚 
输出: 无
********************************/
void GPIO_SetBits(GPIO_Type* GPIOx, uint32_t GPIO_Pin)
{
    assert_param(IS_GPIO_ALL_PERIPH(GPIOx));
    assert_param(IS_GPIO_PIN(GPIO_Pin));

    GPIOx->DSET = GPIO_Pin;
}

/********************************
GPIOx输出置0函数
功能: GPIOx输出置0
输入：GPIO端口  GPIO_PIN引脚 
输出: 无
********************************/
void GPIO_ResetBits(GPIO_Type* GPIOx, uint32_t GPIO_Pin)
{
    assert_param(IS_GPIO_ALL_PERIPH(GPIOx));
    assert_param(IS_GPIO_PIN(GPIO_Pin));
	
    GPIOx->DRST = GPIO_Pin;
}

/********************************
GPIOx输出翻转函数
功能: GPIOx输出置0
输入：GPIO端口  GPIO_PIN引脚 
输出: 无
********************************/
void GPIO_ToggleBits(GPIO_Type* GPIOx, uint32_t GPIO_Pin)
{
    assert_param(IS_GPIO_ALL_PERIPH(GPIOx));
    assert_param(IS_GPIO_PIN(GPIO_Pin));
	
	if(GPIO_Pin&GPIOx->DO)
	{
		GPIOx->DRST = GPIO_Pin;	
	}
	else
	{
		GPIOx->DSET = GPIO_Pin;
	}
}

/********************************
GPIOH输出置1函数
功能: GPIOH输出置1
输入：GPIO_PIN引脚 
输出: 无
Note:操作GPIOH需打开CDIF(CDIF_CR_INTF_EN_Setable(ENABLE);)
********************************/
void GPIOH_SetBits(uint32_t GPIO_Pin)
{
    GPIOH->DO |= GPIO_Pin;
}

/********************************
GPIOH输出置0函数
功能: GPIOH输出置0
输入：GPIO_PIN引脚 
输出: 无
Note:操作GPIOH需打开CDIF(CDIF_CR_INTF_EN_Setable(ENABLE);)
********************************/
void GPIOH_ResetBits(uint32_t GPIO_Pin)
{
    GPIOH->DO &= ~GPIO_Pin;
}

/********************************
GPIOH输出翻转函数
功能: GPIOx输出置0
输入：GPIOH端口  GPIO_PIN引脚 
输出: 无
Note:操作GPIOH需打开CDIF(CDIF_CR_INTF_EN_Setable(ENABLE);)
********************************/
void GPIOH_ToggleBits(uint32_t GPIO_Pin)
{
	if(GPIO_Pin&GPIOH->DO)
	{
		 GPIOH->DO &= ~GPIO_Pin;	
	}
	else
	{
		 GPIOH->DO |= GPIO_Pin;
	}
}

/********************************
读取GPIOx输出数据寄存器函数
功能:读取GPIOx输出数据寄存器
输入：GPIOx_PIN引脚 
输出: 数据寄存器值
********************************/
uint32_t GPIO_ReadOutputData(GPIO_Type* GPIOx)
{
	assert_param(IS_GPIO_ALL_PERIPH(GPIOx));
	
	return (GPIOx->DO);
}

/********************************
读取GPIOx输出数据寄存器bit函数
功能:GPIOx输出数据寄存器bit
输入：GPIO端口  GPIO_PIN引脚 
输出: bit状态
********************************/
uint8_t GPIO_ReadOutputDataBit(GPIO_Type* GPIOx, uint32_t GPIO_Pin)
{
    uint8_t bitstatus = 0x00;
	
    assert_param(IS_GPIO_ALL_PERIPH(GPIOx));
    assert_param(IS_GET_GPIO_PIN(GPIO_Pin));
	
    if (((GPIOx->DO) & GPIO_Pin) != (uint32_t)Bit_RESET)
    {
        bitstatus = (uint8_t)Bit_SET;
    }
    else
    {
        bitstatus = (uint8_t)Bit_RESET;
    }
    return bitstatus;
}

/********************************
WKUP引脚配置函数
功能：WKUP引脚配置
输入：WKUP GPIO_PIN引脚        
      ENABLE 使能WKUP功能
      DISABLE 关闭WKUP功能
输出: 无
********************************/
void GPIO_PINWKEN_SetableEx(uint32_t NWKPinDef, FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPIO->PINWKEN |= (1 << NWKPinDef);
	}
	else
	{
		GPIO->PINWKEN &= ~ (1 << NWKPinDef);
	}
}

FunState GPIO_PINWKEN_GetableEx(uint32_t NWKPinDef)
{
	if (GPIO->PINWKEN & (1 << NWKPinDef))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}



/********************************
设置 WKUP边沿选择函数
功能WKUP边沿选择
输入：WKUP GPIO_PIN引脚        
SetValue：GPIO_PINWKEN_PINWKSEL_FALLING   对应的WKUP引脚为下降沿唤醒 
SetValue：GPIO_PINWKEN_PINWKSEL_RISING    对应的WKUP引脚为上升沿唤醒 
SetValue：GPIO_PINWKEN_PINWKSEL_BOTH      对应的WKUP引脚为上升、下降沿唤醒 
输出: 无
********************************/
void GPIO_PINWKSEL_SetEx(uint32_t NWKPinDef, uint32_t SetValue)
{
    uint32_t tmpreg;
    uint32_t postion;
    postion = NWKPinDef * 2 + 8;
	tmpreg = GPIO->PINWKEN;
	tmpreg &= ~(3 << postion);
	tmpreg |= ((SetValue << postion) & GPIO_PINWKEN_PINWKSEL_Msk);
	GPIO->PINWKEN = tmpreg;
}

/********************************
读取 WKUP边沿选择函数 
功能WKUP边沿选择
输入：WKUP GPIO_PIN引脚 
输出: 无
返回值： GPIO_PINWKEN_PINWKSEL_FALLING   对应的WKUP引脚为下降沿唤醒 
        GPIO_PINWKEN_PINWKSEL_RISING    对应的WKUP引脚为上升沿唤醒 
        GPIO_PINWKEN_PINWKSEL_BOTH      对应的WKUP引脚为上升、下降沿唤醒 
********************************/
uint32_t GPIO_PINWKSEL_GetEx(uint32_t NWKPinDef)
{
    uint32_t postion;
    postion = NWKPinDef * 2 + 8;
    return (((GPIO->PINWKEN  & (3 << postion)) & GPIO_PINWKEN_PINWKSEL_Msk) >> postion);
}


/********************************
WKUP中断入口选择函数
功能WKUP中断入口选择
输入：GPIO_PINWKEN_WKISEL_NMI: NMI中断      
      GPIO_PINWKEN_WKISEL_46：#46中断
输出: 无
********************************/
void GPIO_PINWKEN_WKISEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPIO->PINWKEN;
	tmpreg &= ~(GPIO_PINWKEN_WKISEL_Msk);
	tmpreg |= (SetValue & GPIO_PINWKEN_WKISEL_Msk);
	GPIO->PINWKEN = tmpreg;
}
/********************************
读取WKUP中断入口选择函数
功能：读取WKUP中断入口选择
输入：无     
输出: GPIO_PINWKEN_WKISEL_NMI: NMI中断 
      GPIO_PINWKEN_WKISEL_46：#46中断
********************************/
uint32_t GPIO_PINWKEN_WKISEL_Get(void)
{
	return (GPIO->PINWKEN & GPIO_PINWKEN_WKISEL_Msk);
}

/*************************************************************************
 函数名称：GPIO_EXTI_Select_Pin
 功能说明：GPIO EXTI 外部引脚选择
 输入参数：GPIOx 端口 GPIO_Pinpin 端口内引脚 
 输出参数：无
 返回参数无
 *************************************************************************/
void GPIO_EXTI_Select_Pin(GPIO_Type* GPIOx,uint32_t GPIO_Pin)
{
	uint32_t pin_num = 0,i;	
	uint32_t pin_shift;
	uint32_t tmpreg;
	
	for(i= 0;i<16;i++)
	{
		if(GPIO_Pin&(1<<i))
		{
			pin_num = i;
			break;
		}
	}

	if(i == 16)	return;
	
	switch((uint32_t)GPIOx)
	{
		case (uint32_t)GPIOE://
		case (uint32_t)GPIOF://
			if(pin_num > 11)  break;
		
