bajihahaha/-/RTthread_Blink_DeepSleep - 副本 (2)/Drivers/fm33a0xxev_gpio.c
			if((pin_num <= 3))//
			{
				pin_shift = 0;
			}
			else if((pin_num >= 4)&&(pin_num <= 7))
			{
				pin_shift = 2;
			}
			else
			{
				pin_shift = 4;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOF)
			{
				pin_shift += 8;
			}
			pin_num = pin_num % 4;
			tmpreg = GPIO->EXTISEL1;
			tmpreg &= (~(0x00000003 << pin_shift));
			tmpreg |= (pin_num << pin_shift);
			GPIO->EXTISEL1 = tmpreg;
			break;

		case (uint32_t)GPIOA://
		case (uint32_t)GPIOB://
		case (uint32_t)GPIOC://
		case (uint32_t)GPIOD://
			if(((uint32_t)GPIOx == (uint32_t)GPIOA) ||((uint32_t)GPIOx == (uint32_t)GPIOB)||((uint32_t)GPIOx == (uint32_t)GPIOC))
					if(pin_num > 15)  break;
			
			if((uint32_t)GPIOx == (uint32_t)GPIOD)
					if(pin_num > 11)  break;
			
			if((pin_num <= 3))//
			{
				pin_shift = 0;
			}
			else if((pin_num >= 4)&&(pin_num <= 7))
			{
				pin_shift = 2;
			}
			else if((pin_num >= 8)&&(pin_num <= 11))
			{
				pin_shift = 4;
			}
			else
			{
				pin_shift = 6;
			}
			
			if((uint32_t)GPIOx == (uint32_t)GPIOB)
			{
				pin_shift += 8;
			}
			
			if((uint32_t)GPIOx == (uint32_t)GPIOC)
			{
				pin_shift += 16;
			}
			
			if((uint32_t)GPIOx == (uint32_t)GPIOD)
			{
				pin_shift += 24;
			}
			
			pin_num = pin_num % 4;
			tmpreg = GPIO->EXTISEL0;
			tmpreg &= (~(0x00000003 << pin_shift));
			tmpreg |= (pin_num << pin_shift);
			GPIO->EXTISEL0 = tmpreg;
			break;
		default:
			break;
	}
}
/*************************************************************************
 函数名称：GPIO_EXTI_Select_Edge
 功能说明：GPIO EXTI_Select_Edge 外部中断边沿选择
 输入参数：GPIOx 端口 ，GPIO_Pin 端口内引脚 ,edge_select 触发沿
 输出参数：无
 返回参数无
 *************************************************************************/
void GPIO_EXTI_Select_Edge(GPIO_Type* GPIOx,uint32_t GPIO_Pin,GPIOExtiEdge edge_select)
{
	uint32_t pin_num = 0,i;	
	uint32_t pin_shift;
	uint32_t tmpreg;
	for(i= 0;i<16;i++)
	{
		if(GPIO_Pin&(1<<i))
		{
			pin_num = i;
			break;
		}							
	}	
	if(i == 16)	return;
	
	switch((uint32_t)GPIOx)
	{
		case (uint32_t)GPIOA:
		case (uint32_t)GPIOB:
		case (uint32_t)GPIOC:
		case (uint32_t)GPIOD:
			if(pin_num > 15) break;
			if((pin_num <= 3))//
			{
				pin_shift = 0;
			}
			else if((pin_num >= 4)&&(pin_num <= 7))
			{
				pin_shift = 2;
			}
			else if((pin_num >= 8)&&(pin_num <= 11))
			{
				pin_shift = 4;
			}
			else
			{
				pin_shift = 6;
			}
			
			if(((uint32_t)GPIOx == (uint32_t)GPIOB))
			{
				pin_shift += 8;
			}
			
			if(((uint32_t)GPIOx == (uint32_t)GPIOC))
			{
				pin_shift += 16;
			}
			
			if(((uint32_t)GPIOx == (uint32_t)GPIOD))
			{
				pin_shift += 24;
			}
			tmpreg = GPIO->EXTIEDS0;
			tmpreg &= (~(0x00000003 << pin_shift));			  
			tmpreg |= (edge_select << pin_shift);
			GPIO->EXTIEDS0 = tmpreg;
			break;

		case (uint32_t)GPIOE:
		case (uint32_t)GPIOF:
			if(pin_num > 11) break;
			if((pin_num <= 3))//
			{
				pin_shift = 0;
			}
			else if((pin_num >= 4)&&(pin_num <= 7))
			{
				pin_shift = 2;
			}
			else
			{
				pin_shift = 4;
			}
			
			if(((uint32_t)GPIOx == (uint32_t)GPIOF))
			{
				pin_shift += 8;
			}
			tmpreg = GPIO->EXTIEDS1;
			tmpreg &= (~(0x00000003 << pin_shift));			  
			tmpreg |= (edge_select << pin_shift);
			GPIO->EXTIEDS1 = tmpreg;
		default:
			break;
	}
}

/* EXTI数字滤波控制寄存器 相关函数 */
void GPIO_EXTI_EXTIDF_Setable(GPIO_Type* GPIOx, uint32_t GPIO_Pin, FunState NewState)
{
	uint32_t pin_num = 0,i;	
	uint32_t pin_shift;
	uint32_t tmpreg;
	for(i= 0;i<16;i++)
	{
		if(GPIO_Pin&(1<<i))
		{
			pin_num = i;
			break;
		}							
	}
	if(i == 16)	return;

	switch((uint32_t)GPIOx)
	{
		case (uint32_t)GPIOA:
		case (uint32_t)GPIOB:
		case (uint32_t)GPIOC:
		case (uint32_t)GPIOD:
		case (uint32_t)GPIOE:
		case (uint32_t)GPIOF:
			if(((uint32_t)GPIOx == (uint32_t)GPIOE) || ((uint32_t)GPIOx == (uint32_t)GPIOF))
			{
				if(pin_num > 11) break;
			}
			else
			{
				if(pin_num > 15) break;
			}
			
			if((pin_num <= 3))//
			{
				pin_shift = 0;
			}
			else if((pin_num >= 4)&&(pin_num <= 7))
			{
				pin_shift = 1;
			}
			else if((pin_num >= 8)&&(pin_num <= 11))
			{
				pin_shift = 2;
			}
			else
			{
				pin_shift = 3;
			}
			
			if((uint32_t)GPIOx == (uint32_t)GPIOB) 
			{
				pin_shift += 4;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOC) 
			{
				pin_shift += 8;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOD) 
			{
				pin_shift += 12;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOE) 
			{
				pin_shift += 16;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOF) 
			{
				pin_shift += 20;
			}

			tmpreg = GPIO->EXTIDF; 
			if(NewState == ENABLE)
			{
				tmpreg |= 1 << pin_shift;
			}
			else
			{
				tmpreg &= (~(1 << pin_shift));
			}
			GPIO->EXTIDF = tmpreg;
			break;

		default:
			break;
	}

}

/* 读取EXTI输入信号寄存器 */
FunState GPIO_EXTI_EXTIDI_Getable(GPIO_Type* GPIOx, uint32_t GPIO_Pin)
{
	uint32_t pin_num = 0,i;	
	uint32_t pin_shift;
	FunState Result = DISABLE;
	for(i= 0;i<16;i++)
	{
		if(GPIO_Pin&(1<<i))
		{
			pin_num = i;
			break;
		}							
	}
	
	if(i == 16)	return Result;
	
	switch((uint32_t)GPIOx)
	{
		case (uint32_t)GPIOA:
		case (uint32_t)GPIOB:
		case (uint32_t)GPIOC:
		case (uint32_t)GPIOD:
		case (uint32_t)GPIOE:
		case (uint32_t)GPIOF:
			if(((uint32_t)GPIOx == (uint32_t)GPIOE) || ((uint32_t)GPIOx == (uint32_t)GPIOF))
			{
				if(pin_num > 11) break;
			}
			else
			{
				if(pin_num > 15) break;
			}
			
			if((pin_num <= 3))//
			{
				pin_shift = 0;
			}
			else if((pin_num >= 4)&&(pin_num <= 7))
			{
				pin_shift = 1;
			}
			else if((pin_num >= 8)&&(pin_num <= 11))
			{
				pin_shift = 2;
			}
			else
			{
				pin_shift = 3;
			}
			
			if((uint32_t)GPIOx == (uint32_t)GPIOB) 
			{
				pin_shift += 4;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOC) 
			{
				pin_shift += 8;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOD) 
			{
				pin_shift += 12;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOE) 
			{
				pin_shift += 16;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOF) 
			{
				pin_shift += 20;
			}

			if((GPIO->EXTIDI & (1 << pin_shift)) == (1 << pin_shift)) 
			{
			  Result = ENABLE;
			}
			else
			{
			  Result = DISABLE;
			}
			break;
		default:
			break;
	}

	return Result;
}

/*************************************************************************
 函数名称：GPIO_EXTI_EXTIISR_ClrEx
 功能说明：GPIO_EXTI_EXTIISR_ClrEx 清除中断标志
 输入参数：GPIOx 端口 ，GPIO_Pin 端口内引脚 
 输出参数：无
 返回参数无
 *************************************************************************/
void GPIO_EXTI_EXTIISR_ClrEx(GPIO_Type* GPIOx,uint32_t GPIO_Pin)
{
	uint32_t pin_num = 0,i;	
	uint32_t pin_shift;
	uint32_t tmpreg;
	for(i= 0;i<16;i++)
	{
		if(GPIO_Pin&(1<<i))
		{
			pin_num = i;
			break;
		}							
	}

	if(i == 16)	return ;
	
	switch((uint32_t)GPIOx)
	{
		case (uint32_t)GPIOA:
		case (uint32_t)GPIOB:
		case (uint32_t)GPIOC:
		case (uint32_t)GPIOD:
		case (uint32_t)GPIOE:
		case (uint32_t)GPIOF:
			if(((uint32_t)GPIOx == (uint32_t)GPIOE) || ((uint32_t)GPIOx == (uint32_t)GPIOF))
			{
				if(pin_num > 11) break;
			}
			else
			{
				if(pin_num > 15) break;
			}
			
