bajihahaha/-/RTthread_Blink_DeepSleep - 副本 (2)/Drivers/fm33a0xxev_gpio.c
			if((pin_num <= 3))//
			{
				pin_shift = 0;
			}
			else if((pin_num >= 4)&&(pin_num <= 7))
			{
				pin_shift = 1;
			}
			else if((pin_num >= 8)&&(pin_num <= 11))
			{
				pin_shift = 2;
			}
			else
			{
				pin_shift = 3;
			}
			
			if((uint32_t)GPIOx == (uint32_t)GPIOB) 
			{
				pin_shift += 4;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOC) 
			{
				pin_shift += 8;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOD) 
			{
				pin_shift += 12;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOE) 
			{
				pin_shift += 16;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOF) 
			{
				pin_shift += 20;
			}

			tmpreg = GPIO->EXTIISR; 
			tmpreg |= (1 << pin_shift);
			GPIO->EXTIISR = tmpreg;
			break;

		default:
			break;
	}
}
  
/*************************************************************************
 函数名称：GPIO_EXTI_EXTIISR_ChkEx
 功能说明：GPIO_EXTI_EXTIISR_ChkEx 读取中断标志状态
 输入参数：GPIOx 端口 ，GPIO_Pin 端口内引脚 
 输出参数：无
 返回参数FlagStatus 中断标志状态
 *************************************************************************/
FlagStatus GPIO_EXTI_EXTIISR_ChkEx(GPIO_Type* GPIOx,uint32_t GPIO_Pin)
{
	uint32_t pin_num = 0,i;	
	uint32_t pin_shift;
	FlagStatus Result = RESET;
	
	for(i= 0;i<16;i++)
	{
		if(GPIO_Pin&(1<<i))
		{
			pin_num = i;
			break;
		}							
	}
	
	if(i == 16)	return Result;
	
	switch((uint32_t)GPIOx)
	{
		case (uint32_t)GPIOA:
		case (uint32_t)GPIOB:
		case (uint32_t)GPIOC:
		case (uint32_t)GPIOD:
		case (uint32_t)GPIOE:
		case (uint32_t)GPIOF:
			if(((uint32_t)GPIOx == (uint32_t)GPIOE) || ((uint32_t)GPIOx == (uint32_t)GPIOF))
			{
				if(pin_num > 11) break;
			}
			else
			{
				if(pin_num > 15) break;
			}
			
			if((pin_num <= 3))//
			{
				pin_shift = 0;
			}
			else if((pin_num >= 4)&&(pin_num <= 7))
			{
				pin_shift = 1;
			}
			else if((pin_num >= 8)&&(pin_num <= 11))
			{
				pin_shift = 2;
			}
			else
			{
				pin_shift = 3;
			}
			
			if((uint32_t)GPIOx == (uint32_t)GPIOB) 
			{
				pin_shift += 4;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOC) 
			{
				pin_shift += 8;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOD) 
			{
				pin_shift += 12;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOE) 
			{
				pin_shift += 16;
			}
			if((uint32_t)GPIOx == (uint32_t)GPIOF) 
			{
				pin_shift += 20;
			}
			if((GPIO->EXTIISR & (1 << pin_shift)) == (1 << pin_shift)) 	Result = SET;
			break;
		default:
			break;
	}
	
	return Result;
}

/********************************
 FOUT1输出配置函数
功能: 配置FOUT1输出
输入：输出频率选择信号
输出:无
********************************/
void GPIO_FOUTSEL_FOUT1SEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPIO->FOUTSEL;
	tmpreg &= ~(GPIO_FOUTSEL_FOUT1SEL_Msk);
	tmpreg |= (SetValue & GPIO_FOUTSEL_FOUT1SEL_Msk);
	GPIO->FOUTSEL = tmpreg;
}
/********************************
读FOUT1输出状态函数
功能:读FOUT1输出状态
输入：无
输出:FOUT输出选择值
********************************/
uint32_t GPIO_FOUTSEL_FOUT1SEL_Get(void)
{
	return (GPIO->FOUTSEL & GPIO_FOUTSEL_FOUT1SEL_Msk);
}

/********************************
 FOUT0输出配置函数
功能: 配置FOUT0输出
输入：输出频率选择信号
输出:无
********************************/
void GPIO_FOUTSEL_FOUT0SEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPIO->FOUTSEL;
	tmpreg &= ~(GPIO_FOUTSEL_FOUT0SEL_Msk);
	tmpreg |= (SetValue & GPIO_FOUTSEL_FOUT0SEL_Msk);
	GPIO->FOUTSEL = tmpreg;
}
/********************************
读FOUT0输出状态函数
功能:读FOUT0输出状态
输入：无
输出:FOUT输出选择值
********************************/
uint32_t GPIO_FOUTSEL_FOUT0SEL_Get(void)
{
	return (GPIO->FOUTSEL & GPIO_FOUTSEL_FOUT0SEL_Msk);
}


/*************************************************************************
 函数名称：GPIO_EXTI_Init
 功能说明：GPIO_EXTI_Init 外部中断初始化
 输入参数：port 端口 ，pin 端口内引脚 ,edge 触发沿
 输出参数：无
 返回参数无
 *************************************************************************/
void GPIO_EXTI_Init(GPIO_Type* GPIOx, uint32_t GPIO_Pin, GPIOExtiEdge edge_select, FunState DFState)
{
	GPIO_EXTI_Select_Edge(GPIOx, GPIO_Pin, EXTIDISABLE);	//关闭边沿触发
	GPIO_EXTI_Select_Pin(GPIOx, GPIO_Pin);					//外部引脚选择
	GPIO_EXTI_EXTIDF_Setable(GPIOx, GPIO_Pin, DFState);     //数字滤波使能选择
	GPIO_EXTI_Select_Edge(GPIOx, GPIO_Pin, edge_select);	//修改边沿选择
    TicksDelayUs(200);                                      //等待至少4个lsclk
    GPIO_EXTI_EXTIISR_ClrEx(GPIOx, GPIO_Pin);				//清除中断标志
    NVIC_ClearPendingIRQ(GPIO_IRQn);	                    //清除中断挂起
}

/*************************************************************************
 函数名称：GPIO_EXTI_Close
 功能说明：GPIO_EXTI_Close 外部中断关闭
 输入参数：port 端口 ，pin 端口内引脚 
 输出参数：无
 返回参数无
 *************************************************************************/
void GPIO_EXTI_Close(GPIO_Type* GPIOx,uint32_t GPIO_Pin)
{
	GPIO_EXTI_Select_Edge(GPIOx, GPIO_Pin, EXTIDISABLE);//关闭边沿触发
}


/********************************
GPIOH初始化配置函数
功能:GPIO初始化配置
输入：GPIO端口  GPIO_PIN引脚
输出: 无
********************************/
void GPIOH_Init(GPIO_InitTypeDef* para)
{
    uint32_t pinpos = 0x00,pinbit = 0x00,currentpin =0x00;
    uint32_t tmpreg; 
	
    for (pinpos = 0; pinpos < 4; pinpos++)
    {
        pinbit = ((uint32_t)0x01) <<pinpos;
        currentpin = (para->Pin) & pinbit;
			
        if (currentpin == pinbit)
        {
            tmpreg = GPIOH->INEN;
            tmpreg &= ~pinbit;
            tmpreg |= (para->PxINEN)<<pinpos;	
            GPIOH->INEN = tmpreg;
            
            tmpreg = GPIOH->PUEN;
            tmpreg &= ~pinbit;
            tmpreg |= (para->PxPUEN)<<pinpos;
            GPIOH->PUEN = tmpreg;

            pinbit = (((uint32_t)0x00000003)) <<(pinpos*2);
            tmpreg = GPIOH->FCR;
            tmpreg &= ~pinbit;
            tmpreg |= (para->PxFCR)<<(pinpos*2);
            GPIOH->FCR = tmpreg;
        }
    }
}

/********************************
获取一个IO配置参数结构体函数
功能:获取一个IO配置参数结构体
输入：GPIO端口  GPIO_PIN引脚 引脚类型
输出: 无
********************************/
void GPIOH_Get_InitPara(uint32_t GPIO_Pin, GPIO_InitTypeDef* para)
{
    uint32_t pinbit = 0x00;
    uint32_t i,temp;

    assert_param(IS_GET_GPIOH_PIN(GPIO_Pin));
    for (i = 0; i < 4; i++)
    {
        pinbit = GPIO_Pin & (1<<i);
        if(pinbit > 0) break;
    }

    if(i < 4)
    {
        pinbit = i;
        para->Pin = GPIO_Pin;
        
