bajihahaha/-/RTthread_Blink_DeepSleep - 副本 (2)/Drivers/fm33a0xxev_gpio.c
        temp = (GPIOH->INEN&GPIO_Pin)>>pinbit;
        if(temp == (uint32_t)GPIO_IN_En)
        {                                         
            para->PxINEN = GPIO_IN_En;
        }
        else
        {
            para->PxINEN = GPIO_IN_Dis;
        }   
        
        temp = (GPIOH->PUEN&GPIO_Pin)>>pinbit;                                    
        if(temp == (uint32_t)GPIO_PU_En)
        {                                         
            para->PxPUEN = GPIO_PU_En;
        }
        else
        {
            para->PxPUEN = GPIO_PU_Dis;
        }   
                
        temp = (GPIOH->FCR>>(pinbit*2))&0x00000003;                                    
        if(temp == (uint32_t)GPIO_FCR_IN)
        {                                         
            para->PxFCR = GPIO_FCR_IN;
        }
        else if(temp == (uint32_t)GPIO_FCR_OUT)
        {
            para->PxFCR = GPIO_FCR_OUT;
        }
        else if(temp == (uint32_t)GPIO_FCR_DIG)
        {                                         
            para->PxFCR = GPIO_FCR_DIG;
        }
        else
        {
            para->PxFCR = GPIO_FCR_ANA;
        }
    }  
}

/********************************
 PortH输出数据寄存器配置函数
功能: 配置PortH输出数据
输入：uint32_t SetValue（输出值）
输出:无
Note:操作GPIOH需打开CDIF(CDIF_CR_INTF_EN_Setable(ENABLE);)
********************************/
void GPIOH_DO_Write(uint32_t SetValue)
{
	GPIOH->DO = (SetValue & GPIOH_DO_PHDO_Msk);
}
/* 
读取GPIOH输出寄存器 
Note:操作GPIOH需打开CDIF(CDIF_CR_INTF_EN_Setable(ENABLE);)
*/
uint32_t GPIOH_ReadOutputData(void)
{
	return (GPIOH->DO & GPIOH_DO_PHDO_Msk);
}

/* 
按管脚Pin读取输出寄存器 
Note:操作GPIOH需打开CDIF(CDIF_CR_INTF_EN_Setable(ENABLE);)
*/
uint8_t GPIOH_ReadOutputDataBit(uint32_t GPIO_Pin)
{
    uint8_t bitstatus = 0x00;
    assert_param(IS_GET_GPIOH_PIN(GPIO_Pin));
    if ((GPIOH->DO & GPIO_Pin) != (uint32_t)Bit_RESET)
    {
        bitstatus = (uint8_t)Bit_SET;
    }
    else
    {
        bitstatus = (uint8_t)Bit_RESET;
    }
    return bitstatus;
}

/* 
读取GPIOH输入寄存器 
Note:操作GPIOH需打开CDIF(CDIF_CR_INTF_EN_Setable(ENABLE);)
*/
uint32_t GPIOH_ReadInputData(void)
{
	return (GPIOH->DIN & GPIOH_DIN_PHDIN_Msk);
}

/* 
按管脚Pin读取输入寄存器
Note:操作GPIOH需打开CDIF(CDIF_CR_INTF_EN_Setable(ENABLE);)
*/
uint8_t GPIOH_ReadInputDataBit(uint32_t GPIO_Pin)
{
    uint8_t bitstatus = 0x00;
    assert_param(IS_GET_GPIOH_PIN(GPIO_Pin));
    if ((GPIOH->DIN & GPIO_Pin) != (uint32_t)Bit_RESET)
    {
        bitstatus = (uint8_t)Bit_SET;
    }
    else
    {
        bitstatus = (uint8_t)Bit_RESET;
    }
    return bitstatus;
}

/********************************
 IOMCR四选一输出配置函数
功能: 配置IO四选一输出
输入：输出IO通道选择配置
输出:无
********************************/
void GPIO_IOMCR_IOMUXSEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = GPIO->IOMCR;
	tmpreg &= ~(GPIO_IOMCR_IOMUXSEL_Msk);
	tmpreg |= (SetValue & GPIO_IOMCR_IOMUXSEL_Msk);
	GPIO->IOMCR = tmpreg;
}
/********************************
读IOMCR四选一配置函数
功能:读IOMCR四选一配置状态
输入：无
输出:IOMCR四选一配置选择值
********************************/
uint32_t GPIO_IOMCR_IOMUXSEL_Get(void)
{
	return (GPIO->IOMCR & GPIO_IOMCR_IOMUXSEL_Msk);
}

/* GPIO 四选一使能 函数 */
void GPIO_IOMCR_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		GPIO->IOMCR |=  GPIO_IOMCR_IOMCUEN_Msk;
	}
	else
	{
		GPIO->IOMCR &= ~(GPIO_IOMCR_IOMCUEN_Msk);
	}
}

FunState GPIO_IOMCR_Getable(void)
{
	if (GPIO->IOMCR  & (GPIO_IOMCR_IOMCUEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/******END OF FILE****/
